Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32V873/Includes/Registers/stm32V873_hsem.h
/*
 * SPDX-License-Identifier: MIT
 *
 * Goal:     stm32V873_hsem equates.
 */
#pragma once

#include    <stdint.h>

// HSEM address definitions
// ------------------------

typedef struct {
    volatile    uint32_t    R0;
    volatile    uint32_t    R1;
    volatile    uint32_t    R2;
    volatile    uint32_t    R3;
    volatile    uint32_t    R4;
    volatile    uint32_t    R5;
    volatile    uint32_t    R6;
    volatile    uint32_t    R7;
    volatile    uint32_t    R8;
    volatile    uint32_t    R9;
    volatile    uint32_t    R10;
    volatile    uint32_t    R11;
    volatile    uint32_t    R12;
    volatile    uint32_t    R13;
    volatile    uint32_t    R14;
    volatile    uint32_t    R15;
    volatile    uint32_t    R16;
    volatile    uint32_t    R17;
    volatile    uint32_t    R18;
    volatile    uint32_t    R19;
    volatile    uint32_t    R20;
    volatile    uint32_t    R21;
    volatile    uint32_t    R22;
    volatile    uint32_t    R23;
    volatile    uint32_t    R24;
    volatile    uint32_t    R25;
    volatile    uint32_t    R26;
    volatile    uint32_t    R27;
    volatile    uint32_t    R28;
    volatile    uint32_t    R29;
    volatile    uint32_t    R30;
    volatile    uint32_t    R31;
    volatile    uint32_t    RLR0;
    volatile    uint32_t    RLR1;
    volatile    uint32_t    RLR2;
    volatile    uint32_t    RLR3;
    volatile    uint32_t    RLR4;
    volatile    uint32_t    RLR5;
    volatile    uint32_t    RLR6;
    volatile    uint32_t    RLR7;
    volatile    uint32_t    RLR8;
    volatile    uint32_t    RLR9;
    volatile    uint32_t    RLR10;
    volatile    uint32_t    RLR11;
    volatile    uint32_t    RLR12;
    volatile    uint32_t    RLR13;
    volatile    uint32_t    RLR14;
    volatile    uint32_t    RLR15;
    volatile    uint32_t    RLR16;
    volatile    uint32_t    RLR17;
    volatile    uint32_t    RLR18;
    volatile    uint32_t    RLR19;
    volatile    uint32_t    RLR20;
    volatile    uint32_t    RLR21;
    volatile    uint32_t    RLR22;
    volatile    uint32_t    RLR23;
    volatile    uint32_t    RLR24;
    volatile    uint32_t    RLR25;
    volatile    uint32_t    RLR26;
    volatile    uint32_t    RLR27;
    volatile    uint32_t    RLR28;
    volatile    uint32_t    RLR29;
    volatile    uint32_t    RLR30;
    volatile    uint32_t    RLR31;
    volatile    uint32_t    IER;
    volatile    uint32_t    ICR;
    volatile    uint32_t    ISR;
    volatile    uint32_t    MISR;
    volatile    uint32_t    RESERVED0[28];
    volatile    uint32_t    SIER;
    volatile    uint32_t    SICR;
    volatile    uint32_t    SISR;
    volatile    uint32_t    MSISR;
    volatile    uint32_t    RESERVED1[28];
    volatile    uint32_t    SECCFGR;
    volatile    uint32_t    RESERVED2[3];
    volatile    uint32_t    PRIVCFGR;
    volatile    uint32_t    RESERVED3[7];
    volatile    uint32_t    CR;
    volatile    uint32_t    KEYR;
} HSEM_TypeDef;

#if (defined(__cplusplus))
#define HSEM_NS     reinterpret_cast<HSEM_TypeDef *>(0x46026400u)
#define HSEM_S      reinterpret_cast<HSEM_TypeDef *>(0x56026400u)

#else
#define HSEM_NS     ((HSEM_TypeDef *)0x46026400u)
#define HSEM_S      ((HSEM_TypeDef *)0x56026400u)
#endif

// R0 Configuration

#define HSEM_R0_LOCK                (0x1u<<31)
#define HSEM_R0_PRIV                (0x1u<<13)
#define HSEM_R0_SEC                 (0x1u<<12)
#define HSEM_R0_LOCKID              (0xFu<<8)
#define HSEM_R0_LOCKID_0            (0x1u<<8)
#define HSEM_R0_PROCID              (0xFFu<<0)
#define HSEM_R0_PROCID_0            (0x1u<<0)

#define HSEM_R0_LOCK_B_0X0          (0x0u<<31)
#define HSEM_R0_LOCK_B_0X1          (0x1u<<31)
#define HSEM_R0_PRIV_B_0X0          (0x0u<<13)
#define HSEM_R0_PRIV_B_0X1          (0x1u<<13)
#define HSEM_R0_SEC_B_0X0           (0x0u<<12)
#define HSEM_R0_SEC_B_0X1           (0x1u<<12)

// R1 Configuration

#define HSEM_R1_LOCK                (0x1u<<31)
#define HSEM_R1_PRIV                (0x1u<<13)
#define HSEM_R1_SEC                 (0x1u<<12)
#define HSEM_R1_LOCKID              (0xFu<<8)
#define HSEM_R1_LOCKID_0            (0x1u<<8)
#define HSEM_R1_PROCID              (0xFFu<<0)
#define HSEM_R1_PROCID_0            (0x1u<<0)

#define HSEM_R1_LOCK_B_0X0          (0x0u<<31)
#define HSEM_R1_LOCK_B_0X1          (0x1u<<31)
#define HSEM_R1_PRIV_B_0X0          (0x0u<<13)
#define HSEM_R1_PRIV_B_0X1          (0x1u<<13)
#define HSEM_R1_SEC_B_0X0           (0x0u<<12)
#define HSEM_R1_SEC_B_0X1           (0x1u<<12)

// R2 Configuration

#define HSEM_R2_LOCK                (0x1u<<31)
#define HSEM_R2_PRIV                (0x1u<<13)
#define HSEM_R2_SEC                 (0x1u<<12)
#define HSEM_R2_LOCKID              (0xFu<<8)
#define HSEM_R2_LOCKID_0            (0x1u<<8)
#define HSEM_R2_PROCID              (0xFFu<<0)
#define HSEM_R2_PROCID_0            (0x1u<<0)

#define HSEM_R2_LOCK_B_0X0          (0x0u<<31)
#define HSEM_R2_LOCK_B_0X1          (0x1u<<31)
#define HSEM_R2_PRIV_B_0X0          (0x0u<<13)
#define HSEM_R2_PRIV_B_0X1          (0x1u<<13)
#define HSEM_R2_SEC_B_0X0           (0x0u<<12)
#define HSEM_R2_SEC_B_0X1           (0x1u<<12)

// R3 Configuration

#define HSEM_R3_LOCK                (0x1u<<31)
#define HSEM_R3_PRIV                (0x1u<<13)
#define HSEM_R3_SEC                 (0x1u<<12)
#define HSEM_R3_LOCKID              (0xFu<<8)
#define HSEM_R3_LOCKID_0            (0x1u<<8)
#define HSEM_R3_PROCID              (0xFFu<<0)
#define HSEM_R3_PROCID_0            (0x1u<<0)

#define HSEM_R3_LOCK_B_0X0          (0x0u<<31)
#define HSEM_R3_LOCK_B_0X1          (0x1u<<31)
#define HSEM_R3_PRIV_B_0X0          (0x0u<<13)
#define HSEM_R3_PRIV_B_0X1          (0x1u<<13)
#define HSEM_R3_SEC_B_0X0           (0x0u<<12)
#define HSEM_R3_SEC_B_0X1           (0x1u<<12)

// R4 Configuration

#define HSEM_R4_LOCK                (0x1u<<31)
#define HSEM_R4_PRIV                (0x1u<<13)
#define HSEM_R4_SEC                 (0x1u<<12)
#define HSEM_R4_LOCKID              (0xFu<<8)
#define HSEM_R4_LOCKID_0            (0x1u<<8)
#define HSEM_R4_PROCID              (0xFFu<<0)
#define HSEM_R4_PROCID_0            (0x1u<<0)

#define HSEM_R4_LOCK_B_0X0          (0x0u<<31)
#define HSEM_R4_LOCK_B_0X1          (0x1u<<31)
#define HSEM_R4_PRIV_B_0X0          (0x0u<<13)
#define HSEM_R4_PRIV_B_0X1          (0x1u<<13)
#define HSEM_R4_SEC_B_0X0           (0x0u<<12)
#define HSEM_R4_SEC_B_0X1           (0x1u<<12)

// R5 Configuration

#define HSEM_R5_LOCK                (0x1u<<31)
#define HSEM_R5_PRIV                (0x1u<<13)
#define HSEM_R5_SEC                 (0x1u<<12)
#define HSEM_R5_LOCKID              (0xFu<<8)
#define HSEM_R5_LOCKID_0            (0x1u<<8)
#define HSEM_R5_PROCID              (0xFFu<<0)
#define HSEM_R5_PROCID_0            (0x1u<<0)

