Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32V873/Includes/Registers/stm32V873_hsem.h
#define HSEM_R5_LOCK_B_0X0          (0x0u<<31)
#define HSEM_R5_LOCK_B_0X1          (0x1u<<31)
#define HSEM_R5_PRIV_B_0X0          (0x0u<<13)
#define HSEM_R5_PRIV_B_0X1          (0x1u<<13)
#define HSEM_R5_SEC_B_0X0           (0x0u<<12)
#define HSEM_R5_SEC_B_0X1           (0x1u<<12)

// R6 Configuration

#define HSEM_R6_LOCK                (0x1u<<31)
#define HSEM_R6_PRIV                (0x1u<<13)
#define HSEM_R6_SEC                 (0x1u<<12)
#define HSEM_R6_LOCKID              (0xFu<<8)
#define HSEM_R6_LOCKID_0            (0x1u<<8)
#define HSEM_R6_PROCID              (0xFFu<<0)
#define HSEM_R6_PROCID_0            (0x1u<<0)

#define HSEM_R6_LOCK_B_0X0          (0x0u<<31)
#define HSEM_R6_LOCK_B_0X1          (0x1u<<31)
#define HSEM_R6_PRIV_B_0X0          (0x0u<<13)
#define HSEM_R6_PRIV_B_0X1          (0x1u<<13)
#define HSEM_R6_SEC_B_0X0           (0x0u<<12)
#define HSEM_R6_SEC_B_0X1           (0x1u<<12)

// R7 Configuration

#define HSEM_R7_LOCK                (0x1u<<31)
#define HSEM_R7_PRIV                (0x1u<<13)
#define HSEM_R7_SEC                 (0x1u<<12)
#define HSEM_R7_LOCKID              (0xFu<<8)
#define HSEM_R7_LOCKID_0            (0x1u<<8)
#define HSEM_R7_PROCID              (0xFFu<<0)
#define HSEM_R7_PROCID_0            (0x1u<<0)

#define HSEM_R7_LOCK_B_0X0          (0x0u<<31)
#define HSEM_R7_LOCK_B_0X1          (0x1u<<31)
#define HSEM_R7_PRIV_B_0X0          (0x0u<<13)
#define HSEM_R7_PRIV_B_0X1          (0x1u<<13)
#define HSEM_R7_SEC_B_0X0           (0x0u<<12)
#define HSEM_R7_SEC_B_0X1           (0x1u<<12)

// R8 Configuration

#define HSEM_R8_LOCK                (0x1u<<31)
#define HSEM_R8_PRIV                (0x1u<<13)
#define HSEM_R8_SEC                 (0x1u<<12)
#define HSEM_R8_LOCKID              (0xFu<<8)
#define HSEM_R8_LOCKID_0            (0x1u<<8)
#define HSEM_R8_PROCID              (0xFFu<<0)
#define HSEM_R8_PROCID_0            (0x1u<<0)

#define HSEM_R8_LOCK_B_0X0          (0x0u<<31)
#define HSEM_R8_LOCK_B_0X1          (0x1u<<31)
#define HSEM_R8_PRIV_B_0X0          (0x0u<<13)
#define HSEM_R8_PRIV_B_0X1          (0x1u<<13)
#define HSEM_R8_SEC_B_0X0           (0x0u<<12)
#define HSEM_R8_SEC_B_0X1           (0x1u<<12)

// R9 Configuration

#define HSEM_R9_LOCK                (0x1u<<31)
#define HSEM_R9_PRIV                (0x1u<<13)
#define HSEM_R9_SEC                 (0x1u<<12)
#define HSEM_R9_LOCKID              (0xFu<<8)
#define HSEM_R9_LOCKID_0            (0x1u<<8)
#define HSEM_R9_PROCID              (0xFFu<<0)
#define HSEM_R9_PROCID_0            (0x1u<<0)

#define HSEM_R9_LOCK_B_0X0          (0x0u<<31)
#define HSEM_R9_LOCK_B_0X1          (0x1u<<31)
#define HSEM_R9_PRIV_B_0X0          (0x0u<<13)
#define HSEM_R9_PRIV_B_0X1          (0x1u<<13)
#define HSEM_R9_SEC_B_0X0           (0x0u<<12)
#define HSEM_R9_SEC_B_0X1           (0x1u<<12)

// R10 Configuration

#define HSEM_R10_LOCK               (0x1u<<31)
#define HSEM_R10_PRIV               (0x1u<<13)
#define HSEM_R10_SEC                (0x1u<<12)
#define HSEM_R10_LOCKID             (0xFu<<8)
#define HSEM_R10_LOCKID_0           (0x1u<<8)
#define HSEM_R10_PROCID             (0xFFu<<0)
#define HSEM_R10_PROCID_0           (0x1u<<0)

#define HSEM_R10_LOCK_B_0X0         (0x0u<<31)
#define HSEM_R10_LOCK_B_0X1         (0x1u<<31)
#define HSEM_R10_PRIV_B_0X0         (0x0u<<13)
#define HSEM_R10_PRIV_B_0X1         (0x1u<<13)
#define HSEM_R10_SEC_B_0X0          (0x0u<<12)
#define HSEM_R10_SEC_B_0X1          (0x1u<<12)

// R11 Configuration

#define HSEM_R11_LOCK               (0x1u<<31)
#define HSEM_R11_PRIV               (0x1u<<13)
#define HSEM_R11_SEC                (0x1u<<12)
#define HSEM_R11_LOCKID             (0xFu<<8)
#define HSEM_R11_LOCKID_0           (0x1u<<8)
#define HSEM_R11_PROCID             (0xFFu<<0)
#define HSEM_R11_PROCID_0           (0x1u<<0)

#define HSEM_R11_LOCK_B_0X0         (0x0u<<31)
#define HSEM_R11_LOCK_B_0X1         (0x1u<<31)
#define HSEM_R11_PRIV_B_0X0         (0x0u<<13)
#define HSEM_R11_PRIV_B_0X1         (0x1u<<13)
#define HSEM_R11_SEC_B_0X0          (0x0u<<12)
#define HSEM_R11_SEC_B_0X1          (0x1u<<12)

// R12 Configuration

#define HSEM_R12_LOCK               (0x1u<<31)
#define HSEM_R12_PRIV               (0x1u<<13)
#define HSEM_R12_SEC                (0x1u<<12)
#define HSEM_R12_LOCKID             (0xFu<<8)
#define HSEM_R12_LOCKID_0           (0x1u<<8)
#define HSEM_R12_PROCID             (0xFFu<<0)
#define HSEM_R12_PROCID_0           (0x1u<<0)

#define HSEM_R12_LOCK_B_0X0         (0x0u<<31)
#define HSEM_R12_LOCK_B_0X1         (0x1u<<31)
#define HSEM_R12_PRIV_B_0X0         (0x0u<<13)
#define HSEM_R12_PRIV_B_0X1         (0x1u<<13)
#define HSEM_R12_SEC_B_0X0          (0x0u<<12)
#define HSEM_R12_SEC_B_0X1          (0x1u<<12)

// R13 Configuration

#define HSEM_R13_LOCK               (0x1u<<31)
#define HSEM_R13_PRIV               (0x1u<<13)
#define HSEM_R13_SEC                (0x1u<<12)
#define HSEM_R13_LOCKID             (0xFu<<8)
#define HSEM_R13_LOCKID_0           (0x1u<<8)
#define HSEM_R13_PROCID             (0xFFu<<0)
#define HSEM_R13_PROCID_0           (0x1u<<0)

#define HSEM_R13_LOCK_B_0X0         (0x0u<<31)
#define HSEM_R13_LOCK_B_0X1         (0x1u<<31)
#define HSEM_R13_PRIV_B_0X0         (0x0u<<13)
#define HSEM_R13_PRIV_B_0X1         (0x1u<<13)
#define HSEM_R13_SEC_B_0X0          (0x0u<<12)
#define HSEM_R13_SEC_B_0X1          (0x1u<<12)

// R14 Configuration

#define HSEM_R14_LOCK               (0x1u<<31)
#define HSEM_R14_PRIV               (0x1u<<13)
#define HSEM_R14_SEC                (0x1u<<12)
#define HSEM_R14_LOCKID             (0xFu<<8)
#define HSEM_R14_LOCKID_0           (0x1u<<8)
#define HSEM_R14_PROCID             (0xFFu<<0)
#define HSEM_R14_PROCID_0           (0x1u<<0)

#define HSEM_R14_LOCK_B_0X0         (0x0u<<31)
#define HSEM_R14_LOCK_B_0X1         (0x1u<<31)
#define HSEM_R14_PRIV_B_0X0         (0x0u<<13)
#define HSEM_R14_PRIV_B_0X1         (0x1u<<13)
#define HSEM_R14_SEC_B_0X0          (0x0u<<12)
#define HSEM_R14_SEC_B_0X1          (0x1u<<12)

// R15 Configuration

#define HSEM_R15_LOCK               (0x1u<<31)
#define HSEM_R15_PRIV               (0x1u<<13)
#define HSEM_R15_SEC                (0x1u<<12)
#define HSEM_R15_LOCKID             (0xFu<<8)
#define HSEM_R15_LOCKID_0           (0x1u<<8)
#define HSEM_R15_PROCID             (0xFFu<<0)
#define HSEM_R15_PROCID_0           (0x1u<<0)

