Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32V873/Includes/Registers/stm32V873_hsem.h
#define HSEM_R15_LOCK_B_0X0         (0x0u<<31)
#define HSEM_R15_LOCK_B_0X1         (0x1u<<31)
#define HSEM_R15_PRIV_B_0X0         (0x0u<<13)
#define HSEM_R15_PRIV_B_0X1         (0x1u<<13)
#define HSEM_R15_SEC_B_0X0          (0x0u<<12)
#define HSEM_R15_SEC_B_0X1          (0x1u<<12)

// R16 Configuration

#define HSEM_R16_LOCK               (0x1u<<31)
#define HSEM_R16_PRIV               (0x1u<<13)
#define HSEM_R16_SEC                (0x1u<<12)
#define HSEM_R16_LOCKID             (0xFu<<8)
#define HSEM_R16_LOCKID_0           (0x1u<<8)
#define HSEM_R16_PROCID             (0xFFu<<0)
#define HSEM_R16_PROCID_0           (0x1u<<0)

#define HSEM_R16_LOCK_B_0X0         (0x0u<<31)
#define HSEM_R16_LOCK_B_0X1         (0x1u<<31)
#define HSEM_R16_PRIV_B_0X0         (0x0u<<13)
#define HSEM_R16_PRIV_B_0X1         (0x1u<<13)
#define HSEM_R16_SEC_B_0X0          (0x0u<<12)
#define HSEM_R16_SEC_B_0X1          (0x1u<<12)

// R17 Configuration

#define HSEM_R17_LOCK               (0x1u<<31)
#define HSEM_R17_PRIV               (0x1u<<13)
#define HSEM_R17_SEC                (0x1u<<12)
#define HSEM_R17_LOCKID             (0xFu<<8)
#define HSEM_R17_LOCKID_0           (0x1u<<8)
#define HSEM_R17_PROCID             (0xFFu<<0)
#define HSEM_R17_PROCID_0           (0x1u<<0)

#define HSEM_R17_LOCK_B_0X0         (0x0u<<31)
#define HSEM_R17_LOCK_B_0X1         (0x1u<<31)
#define HSEM_R17_PRIV_B_0X0         (0x0u<<13)
#define HSEM_R17_PRIV_B_0X1         (0x1u<<13)
#define HSEM_R17_SEC_B_0X0          (0x0u<<12)
#define HSEM_R17_SEC_B_0X1          (0x1u<<12)

// R18 Configuration

#define HSEM_R18_LOCK               (0x1u<<31)
#define HSEM_R18_PRIV               (0x1u<<13)
#define HSEM_R18_SEC                (0x1u<<12)
#define HSEM_R18_LOCKID             (0xFu<<8)
#define HSEM_R18_LOCKID_0           (0x1u<<8)
#define HSEM_R18_PROCID             (0xFFu<<0)
#define HSEM_R18_PROCID_0           (0x1u<<0)

#define HSEM_R18_LOCK_B_0X0         (0x0u<<31)
#define HSEM_R18_LOCK_B_0X1         (0x1u<<31)
#define HSEM_R18_PRIV_B_0X0         (0x0u<<13)
#define HSEM_R18_PRIV_B_0X1         (0x1u<<13)
#define HSEM_R18_SEC_B_0X0          (0x0u<<12)
#define HSEM_R18_SEC_B_0X1          (0x1u<<12)

// R19 Configuration

#define HSEM_R19_LOCK               (0x1u<<31)
#define HSEM_R19_PRIV               (0x1u<<13)
#define HSEM_R19_SEC                (0x1u<<12)
#define HSEM_R19_LOCKID             (0xFu<<8)
#define HSEM_R19_LOCKID_0           (0x1u<<8)
#define HSEM_R19_PROCID             (0xFFu<<0)
#define HSEM_R19_PROCID_0           (0x1u<<0)

#define HSEM_R19_LOCK_B_0X0         (0x0u<<31)
#define HSEM_R19_LOCK_B_0X1         (0x1u<<31)
#define HSEM_R19_PRIV_B_0X0         (0x0u<<13)
#define HSEM_R19_PRIV_B_0X1         (0x1u<<13)
#define HSEM_R19_SEC_B_0X0          (0x0u<<12)
#define HSEM_R19_SEC_B_0X1          (0x1u<<12)

// R20 Configuration

#define HSEM_R20_LOCK               (0x1u<<31)
#define HSEM_R20_PRIV               (0x1u<<13)
#define HSEM_R20_SEC                (0x1u<<12)
#define HSEM_R20_LOCKID             (0xFu<<8)
#define HSEM_R20_LOCKID_0           (0x1u<<8)
#define HSEM_R20_PROCID             (0xFFu<<0)
#define HSEM_R20_PROCID_0           (0x1u<<0)

#define HSEM_R20_LOCK_B_0X0         (0x0u<<31)
#define HSEM_R20_LOCK_B_0X1         (0x1u<<31)
#define HSEM_R20_PRIV_B_0X0         (0x0u<<13)
#define HSEM_R20_PRIV_B_0X1         (0x1u<<13)
#define HSEM_R20_SEC_B_0X0          (0x0u<<12)
#define HSEM_R20_SEC_B_0X1          (0x1u<<12)

// R21 Configuration

#define HSEM_R21_LOCK               (0x1u<<31)
#define HSEM_R21_PRIV               (0x1u<<13)
#define HSEM_R21_SEC                (0x1u<<12)
#define HSEM_R21_LOCKID             (0xFu<<8)
#define HSEM_R21_LOCKID_0           (0x1u<<8)
#define HSEM_R21_PROCID             (0xFFu<<0)
#define HSEM_R21_PROCID_0           (0x1u<<0)

#define HSEM_R21_LOCK_B_0X0         (0x0u<<31)
#define HSEM_R21_LOCK_B_0X1         (0x1u<<31)
#define HSEM_R21_PRIV_B_0X0         (0x0u<<13)
#define HSEM_R21_PRIV_B_0X1         (0x1u<<13)
#define HSEM_R21_SEC_B_0X0          (0x0u<<12)
#define HSEM_R21_SEC_B_0X1          (0x1u<<12)

// R22 Configuration

#define HSEM_R22_LOCK               (0x1u<<31)
#define HSEM_R22_PRIV               (0x1u<<13)
#define HSEM_R22_SEC                (0x1u<<12)
#define HSEM_R22_LOCKID             (0xFu<<8)
#define HSEM_R22_LOCKID_0           (0x1u<<8)
#define HSEM_R22_PROCID             (0xFFu<<0)
#define HSEM_R22_PROCID_0           (0x1u<<0)

#define HSEM_R22_LOCK_B_0X0         (0x0u<<31)
#define HSEM_R22_LOCK_B_0X1         (0x1u<<31)
#define HSEM_R22_PRIV_B_0X0         (0x0u<<13)
#define HSEM_R22_PRIV_B_0X1         (0x1u<<13)
#define HSEM_R22_SEC_B_0X0          (0x0u<<12)
#define HSEM_R22_SEC_B_0X1          (0x1u<<12)

// R23 Configuration

#define HSEM_R23_LOCK               (0x1u<<31)
#define HSEM_R23_PRIV               (0x1u<<13)
#define HSEM_R23_SEC                (0x1u<<12)
#define HSEM_R23_LOCKID             (0xFu<<8)
#define HSEM_R23_LOCKID_0           (0x1u<<8)
#define HSEM_R23_PROCID             (0xFFu<<0)
#define HSEM_R23_PROCID_0           (0x1u<<0)

#define HSEM_R23_LOCK_B_0X0         (0x0u<<31)
#define HSEM_R23_LOCK_B_0X1         (0x1u<<31)
#define HSEM_R23_PRIV_B_0X0         (0x0u<<13)
#define HSEM_R23_PRIV_B_0X1         (0x1u<<13)
#define HSEM_R23_SEC_B_0X0          (0x0u<<12)
#define HSEM_R23_SEC_B_0X1          (0x1u<<12)

// R24 Configuration

#define HSEM_R24_LOCK               (0x1u<<31)
#define HSEM_R24_PRIV               (0x1u<<13)
#define HSEM_R24_SEC                (0x1u<<12)
#define HSEM_R24_LOCKID             (0xFu<<8)
#define HSEM_R24_LOCKID_0           (0x1u<<8)
#define HSEM_R24_PROCID             (0xFFu<<0)
#define HSEM_R24_PROCID_0           (0x1u<<0)

#define HSEM_R24_LOCK_B_0X0         (0x0u<<31)
#define HSEM_R24_LOCK_B_0X1         (0x1u<<31)
#define HSEM_R24_PRIV_B_0X0         (0x0u<<13)
#define HSEM_R24_PRIV_B_0X1         (0x1u<<13)
#define HSEM_R24_SEC_B_0X0          (0x0u<<12)
#define HSEM_R24_SEC_B_0X1          (0x1u<<12)

// R25 Configuration

#define HSEM_R25_LOCK               (0x1u<<31)
#define HSEM_R25_PRIV               (0x1u<<13)
#define HSEM_R25_SEC                (0x1u<<12)
#define HSEM_R25_LOCKID             (0xFu<<8)
#define HSEM_R25_LOCKID_0           (0x1u<<8)
#define HSEM_R25_PROCID             (0xFFu<<0)
#define HSEM_R25_PROCID_0           (0x1u<<0)

#define HSEM_R25_LOCK_B_0X0         (0x0u<<31)
#define HSEM_R25_LOCK_B_0X1         (0x1u<<31)
#define HSEM_R25_PRIV_B_0X0         (0x0u<<13)
#define HSEM_R25_PRIV_B_0X1         (0x1u<<13)
#define HSEM_R25_SEC_B_0X0          (0x0u<<12)
#define HSEM_R25_SEC_B_0X1          (0x1u<<12)

