Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32V873/Includes/Registers/stm32V873_hsem.h
// R26 Configuration

#define HSEM_R26_LOCK               (0x1u<<31)
#define HSEM_R26_PRIV               (0x1u<<13)
#define HSEM_R26_SEC                (0x1u<<12)
#define HSEM_R26_LOCKID             (0xFu<<8)
#define HSEM_R26_LOCKID_0           (0x1u<<8)
#define HSEM_R26_PROCID             (0xFFu<<0)
#define HSEM_R26_PROCID_0           (0x1u<<0)

#define HSEM_R26_LOCK_B_0X0         (0x0u<<31)
#define HSEM_R26_LOCK_B_0X1         (0x1u<<31)
#define HSEM_R26_PRIV_B_0X0         (0x0u<<13)
#define HSEM_R26_PRIV_B_0X1         (0x1u<<13)
#define HSEM_R26_SEC_B_0X0          (0x0u<<12)
#define HSEM_R26_SEC_B_0X1          (0x1u<<12)

// R27 Configuration

#define HSEM_R27_LOCK               (0x1u<<31)
#define HSEM_R27_PRIV               (0x1u<<13)
#define HSEM_R27_SEC                (0x1u<<12)
#define HSEM_R27_LOCKID             (0xFu<<8)
#define HSEM_R27_LOCKID_0           (0x1u<<8)
#define HSEM_R27_PROCID             (0xFFu<<0)
#define HSEM_R27_PROCID_0           (0x1u<<0)

#define HSEM_R27_LOCK_B_0X0         (0x0u<<31)
#define HSEM_R27_LOCK_B_0X1         (0x1u<<31)
#define HSEM_R27_PRIV_B_0X0         (0x0u<<13)
#define HSEM_R27_PRIV_B_0X1         (0x1u<<13)
#define HSEM_R27_SEC_B_0X0          (0x0u<<12)
#define HSEM_R27_SEC_B_0X1          (0x1u<<12)

// R28 Configuration

#define HSEM_R28_LOCK               (0x1u<<31)
#define HSEM_R28_PRIV               (0x1u<<13)
#define HSEM_R28_SEC                (0x1u<<12)
#define HSEM_R28_LOCKID             (0xFu<<8)
#define HSEM_R28_LOCKID_0           (0x1u<<8)
#define HSEM_R28_PROCID             (0xFFu<<0)
#define HSEM_R28_PROCID_0           (0x1u<<0)

#define HSEM_R28_LOCK_B_0X0         (0x0u<<31)
#define HSEM_R28_LOCK_B_0X1         (0x1u<<31)
#define HSEM_R28_PRIV_B_0X0         (0x0u<<13)
#define HSEM_R28_PRIV_B_0X1         (0x1u<<13)
#define HSEM_R28_SEC_B_0X0          (0x0u<<12)
#define HSEM_R28_SEC_B_0X1          (0x1u<<12)

// R29 Configuration

#define HSEM_R29_LOCK               (0x1u<<31)
#define HSEM_R29_PRIV               (0x1u<<13)
#define HSEM_R29_SEC                (0x1u<<12)
#define HSEM_R29_LOCKID             (0xFu<<8)
#define HSEM_R29_LOCKID_0           (0x1u<<8)
#define HSEM_R29_PROCID             (0xFFu<<0)
#define HSEM_R29_PROCID_0           (0x1u<<0)

#define HSEM_R29_LOCK_B_0X0         (0x0u<<31)
#define HSEM_R29_LOCK_B_0X1         (0x1u<<31)
#define HSEM_R29_PRIV_B_0X0         (0x0u<<13)
#define HSEM_R29_PRIV_B_0X1         (0x1u<<13)
#define HSEM_R29_SEC_B_0X0          (0x0u<<12)
#define HSEM_R29_SEC_B_0X1          (0x1u<<12)

// R30 Configuration

#define HSEM_R30_LOCK               (0x1u<<31)
#define HSEM_R30_PRIV               (0x1u<<13)
#define HSEM_R30_SEC                (0x1u<<12)
#define HSEM_R30_LOCKID             (0xFu<<8)
#define HSEM_R30_LOCKID_0           (0x1u<<8)
#define HSEM_R30_PROCID             (0xFFu<<0)
#define HSEM_R30_PROCID_0           (0x1u<<0)

#define HSEM_R30_LOCK_B_0X0         (0x0u<<31)
#define HSEM_R30_LOCK_B_0X1         (0x1u<<31)
#define HSEM_R30_PRIV_B_0X0         (0x0u<<13)
#define HSEM_R30_PRIV_B_0X1         (0x1u<<13)
#define HSEM_R30_SEC_B_0X0          (0x0u<<12)
#define HSEM_R30_SEC_B_0X1          (0x1u<<12)

// R31 Configuration

#define HSEM_R31_LOCK               (0x1u<<31)
#define HSEM_R31_PRIV               (0x1u<<13)
#define HSEM_R31_SEC                (0x1u<<12)
#define HSEM_R31_LOCKID             (0xFu<<8)
#define HSEM_R31_LOCKID_0           (0x1u<<8)
#define HSEM_R31_PROCID             (0xFFu<<0)
#define HSEM_R31_PROCID_0           (0x1u<<0)

#define HSEM_R31_LOCK_B_0X0         (0x0u<<31)
#define HSEM_R31_LOCK_B_0X1         (0x1u<<31)
#define HSEM_R31_PRIV_B_0X0         (0x0u<<13)
#define HSEM_R31_PRIV_B_0X1         (0x1u<<13)
#define HSEM_R31_SEC_B_0X0          (0x0u<<12)
#define HSEM_R31_SEC_B_0X1          (0x1u<<12)

// RLR0 Configuration

#define HSEM_RLR0_LOCK              (0x1u<<31)
#define HSEM_RLR0_PRIV              (0x1u<<13)
#define HSEM_RLR0_SEC               (0x1u<<12)
#define HSEM_RLR0_LOCKID            (0xFu<<8)
#define HSEM_RLR0_LOCKID_0          (0x1u<<8)
#define HSEM_RLR0_PROCID            (0xFFu<<0)
#define HSEM_RLR0_PROCID_0          (0x1u<<0)

#define HSEM_RLR0_PRIV_B_0X0        (0x0u<<13)
#define HSEM_RLR0_PRIV_B_0X1        (0x1u<<13)
#define HSEM_RLR0_SEC_B_0X0         (0x0u<<12)
#define HSEM_RLR0_SEC_B_0X1         (0x1u<<12)

// RLR1 Configuration

#define HSEM_RLR1_LOCK              (0x1u<<31)
#define HSEM_RLR1_PRIV              (0x1u<<13)
#define HSEM_RLR1_SEC               (0x1u<<12)
#define HSEM_RLR1_LOCKID            (0xFu<<8)
#define HSEM_RLR1_LOCKID_0          (0x1u<<8)
#define HSEM_RLR1_PROCID            (0xFFu<<0)
#define HSEM_RLR1_PROCID_0          (0x1u<<0)

#define HSEM_RLR1_PRIV_B_0X0        (0x0u<<13)
#define HSEM_RLR1_PRIV_B_0X1        (0x1u<<13)
#define HSEM_RLR1_SEC_B_0X0         (0x0u<<12)
#define HSEM_RLR1_SEC_B_0X1         (0x1u<<12)

// RLR2 Configuration

#define HSEM_RLR2_LOCK              (0x1u<<31)
#define HSEM_RLR2_PRIV              (0x1u<<13)
#define HSEM_RLR2_SEC               (0x1u<<12)
#define HSEM_RLR2_LOCKID            (0xFu<<8)
#define HSEM_RLR2_LOCKID_0          (0x1u<<8)
#define HSEM_RLR2_PROCID            (0xFFu<<0)
#define HSEM_RLR2_PROCID_0          (0x1u<<0)

#define HSEM_RLR2_PRIV_B_0X0        (0x0u<<13)
#define HSEM_RLR2_PRIV_B_0X1        (0x1u<<13)
#define HSEM_RLR2_SEC_B_0X0         (0x0u<<12)
#define HSEM_RLR2_SEC_B_0X1         (0x1u<<12)

// RLR3 Configuration

#define HSEM_RLR3_LOCK              (0x1u<<31)
#define HSEM_RLR3_PRIV              (0x1u<<13)
#define HSEM_RLR3_SEC               (0x1u<<12)
#define HSEM_RLR3_LOCKID            (0xFu<<8)
#define HSEM_RLR3_LOCKID_0          (0x1u<<8)
#define HSEM_RLR3_PROCID            (0xFFu<<0)
#define HSEM_RLR3_PROCID_0          (0x1u<<0)

#define HSEM_RLR3_PRIV_B_0X0        (0x0u<<13)
#define HSEM_RLR3_PRIV_B_0X1        (0x1u<<13)
#define HSEM_RLR3_SEC_B_0X0         (0x0u<<12)
#define HSEM_RLR3_SEC_B_0X1         (0x1u<<12)

// RLR4 Configuration

#define HSEM_RLR4_LOCK              (0x1u<<31)
#define HSEM_RLR4_PRIV              (0x1u<<13)
#define HSEM_RLR4_SEC               (0x1u<<12)
#define HSEM_RLR4_LOCKID            (0xFu<<8)
#define HSEM_RLR4_LOCKID_0          (0x1u<<8)
#define HSEM_RLR4_PROCID            (0xFFu<<0)
#define HSEM_RLR4_PROCID_0          (0x1u<<0)

#define HSEM_RLR4_PRIV_B_0X0        (0x0u<<13)
#define HSEM_RLR4_PRIV_B_0X1        (0x1u<<13)
#define HSEM_RLR4_SEC_B_0X0         (0x0u<<12)
#define HSEM_RLR4_SEC_B_0X1         (0x1u<<12)

