Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32V873/Includes/Registers/stm32V873_hsem.h
// RLR5 Configuration

#define HSEM_RLR5_LOCK              (0x1u<<31)
#define HSEM_RLR5_PRIV              (0x1u<<13)
#define HSEM_RLR5_SEC               (0x1u<<12)
#define HSEM_RLR5_LOCKID            (0xFu<<8)
#define HSEM_RLR5_LOCKID_0          (0x1u<<8)
#define HSEM_RLR5_PROCID            (0xFFu<<0)
#define HSEM_RLR5_PROCID_0          (0x1u<<0)

#define HSEM_RLR5_PRIV_B_0X0        (0x0u<<13)
#define HSEM_RLR5_PRIV_B_0X1        (0x1u<<13)
#define HSEM_RLR5_SEC_B_0X0         (0x0u<<12)
#define HSEM_RLR5_SEC_B_0X1         (0x1u<<12)

// RLR6 Configuration

#define HSEM_RLR6_LOCK              (0x1u<<31)
#define HSEM_RLR6_PRIV              (0x1u<<13)
#define HSEM_RLR6_SEC               (0x1u<<12)
#define HSEM_RLR6_LOCKID            (0xFu<<8)
#define HSEM_RLR6_LOCKID_0          (0x1u<<8)
#define HSEM_RLR6_PROCID            (0xFFu<<0)
#define HSEM_RLR6_PROCID_0          (0x1u<<0)

#define HSEM_RLR6_PRIV_B_0X0        (0x0u<<13)
#define HSEM_RLR6_PRIV_B_0X1        (0x1u<<13)
#define HSEM_RLR6_SEC_B_0X0         (0x0u<<12)
#define HSEM_RLR6_SEC_B_0X1         (0x1u<<12)

// RLR7 Configuration

#define HSEM_RLR7_LOCK              (0x1u<<31)
#define HSEM_RLR7_PRIV              (0x1u<<13)
#define HSEM_RLR7_SEC               (0x1u<<12)
#define HSEM_RLR7_LOCKID            (0xFu<<8)
#define HSEM_RLR7_LOCKID_0          (0x1u<<8)
#define HSEM_RLR7_PROCID            (0xFFu<<0)
#define HSEM_RLR7_PROCID_0          (0x1u<<0)

#define HSEM_RLR7_PRIV_B_0X0        (0x0u<<13)
#define HSEM_RLR7_PRIV_B_0X1        (0x1u<<13)
#define HSEM_RLR7_SEC_B_0X0         (0x0u<<12)
#define HSEM_RLR7_SEC_B_0X1         (0x1u<<12)

// RLR8 Configuration

#define HSEM_RLR8_LOCK              (0x1u<<31)
#define HSEM_RLR8_PRIV              (0x1u<<13)
#define HSEM_RLR8_SEC               (0x1u<<12)
#define HSEM_RLR8_LOCKID            (0xFu<<8)
#define HSEM_RLR8_LOCKID_0          (0x1u<<8)
#define HSEM_RLR8_PROCID            (0xFFu<<0)
#define HSEM_RLR8_PROCID_0          (0x1u<<0)

#define HSEM_RLR8_PRIV_B_0X0        (0x0u<<13)
#define HSEM_RLR8_PRIV_B_0X1        (0x1u<<13)
#define HSEM_RLR8_SEC_B_0X0         (0x0u<<12)
#define HSEM_RLR8_SEC_B_0X1         (0x1u<<12)

// RLR9 Configuration

#define HSEM_RLR9_LOCK              (0x1u<<31)
#define HSEM_RLR9_PRIV              (0x1u<<13)
#define HSEM_RLR9_SEC               (0x1u<<12)
#define HSEM_RLR9_LOCKID            (0xFu<<8)
#define HSEM_RLR9_LOCKID_0          (0x1u<<8)
#define HSEM_RLR9_PROCID            (0xFFu<<0)
#define HSEM_RLR9_PROCID_0          (0x1u<<0)

#define HSEM_RLR9_PRIV_B_0X0        (0x0u<<13)
#define HSEM_RLR9_PRIV_B_0X1        (0x1u<<13)
#define HSEM_RLR9_SEC_B_0X0         (0x0u<<12)
#define HSEM_RLR9_SEC_B_0X1         (0x1u<<12)

// RLR10 Configuration

#define HSEM_RLR10_LOCK             (0x1u<<31)
#define HSEM_RLR10_PRIV             (0x1u<<13)
#define HSEM_RLR10_SEC              (0x1u<<12)
#define HSEM_RLR10_LOCKID           (0xFu<<8)
#define HSEM_RLR10_LOCKID_0         (0x1u<<8)
#define HSEM_RLR10_PROCID           (0xFFu<<0)
#define HSEM_RLR10_PROCID_0         (0x1u<<0)

#define HSEM_RLR10_PRIV_B_0X0       (0x0u<<13)
#define HSEM_RLR10_PRIV_B_0X1       (0x1u<<13)
#define HSEM_RLR10_SEC_B_0X0        (0x0u<<12)
#define HSEM_RLR10_SEC_B_0X1        (0x1u<<12)

// RLR11 Configuration

#define HSEM_RLR11_LOCK             (0x1u<<31)
#define HSEM_RLR11_PRIV             (0x1u<<13)
#define HSEM_RLR11_SEC              (0x1u<<12)
#define HSEM_RLR11_LOCKID           (0xFu<<8)
#define HSEM_RLR11_LOCKID_0         (0x1u<<8)
#define HSEM_RLR11_PROCID           (0xFFu<<0)
#define HSEM_RLR11_PROCID_0         (0x1u<<0)

#define HSEM_RLR11_PRIV_B_0X0       (0x0u<<13)
#define HSEM_RLR11_PRIV_B_0X1       (0x1u<<13)
#define HSEM_RLR11_SEC_B_0X0        (0x0u<<12)
#define HSEM_RLR11_SEC_B_0X1        (0x1u<<12)

// RLR12 Configuration

#define HSEM_RLR12_LOCK             (0x1u<<31)
#define HSEM_RLR12_PRIV             (0x1u<<13)
#define HSEM_RLR12_SEC              (0x1u<<12)
#define HSEM_RLR12_LOCKID           (0xFu<<8)
#define HSEM_RLR12_LOCKID_0         (0x1u<<8)
#define HSEM_RLR12_PROCID           (0xFFu<<0)
#define HSEM_RLR12_PROCID_0         (0x1u<<0)

#define HSEM_RLR12_PRIV_B_0X0       (0x0u<<13)
#define HSEM_RLR12_PRIV_B_0X1       (0x1u<<13)
#define HSEM_RLR12_SEC_B_0X0        (0x0u<<12)
#define HSEM_RLR12_SEC_B_0X1        (0x1u<<12)

// RLR13 Configuration

#define HSEM_RLR13_LOCK             (0x1u<<31)
#define HSEM_RLR13_PRIV             (0x1u<<13)
#define HSEM_RLR13_SEC              (0x1u<<12)
#define HSEM_RLR13_LOCKID           (0xFu<<8)
#define HSEM_RLR13_LOCKID_0         (0x1u<<8)
#define HSEM_RLR13_PROCID           (0xFFu<<0)
#define HSEM_RLR13_PROCID_0         (0x1u<<0)

#define HSEM_RLR13_PRIV_B_0X0       (0x0u<<13)
#define HSEM_RLR13_PRIV_B_0X1       (0x1u<<13)
#define HSEM_RLR13_SEC_B_0X0        (0x0u<<12)
#define HSEM_RLR13_SEC_B_0X1        (0x1u<<12)

// RLR14 Configuration

#define HSEM_RLR14_LOCK             (0x1u<<31)
#define HSEM_RLR14_PRIV             (0x1u<<13)
#define HSEM_RLR14_SEC              (0x1u<<12)
#define HSEM_RLR14_LOCKID           (0xFu<<8)
#define HSEM_RLR14_LOCKID_0         (0x1u<<8)
#define HSEM_RLR14_PROCID           (0xFFu<<0)
#define HSEM_RLR14_PROCID_0         (0x1u<<0)

#define HSEM_RLR14_PRIV_B_0X0       (0x0u<<13)
#define HSEM_RLR14_PRIV_B_0X1       (0x1u<<13)
#define HSEM_RLR14_SEC_B_0X0        (0x0u<<12)
#define HSEM_RLR14_SEC_B_0X1        (0x1u<<12)

// RLR15 Configuration

#define HSEM_RLR15_LOCK             (0x1u<<31)
#define HSEM_RLR15_PRIV             (0x1u<<13)
#define HSEM_RLR15_SEC              (0x1u<<12)
#define HSEM_RLR15_LOCKID           (0xFu<<8)
#define HSEM_RLR15_LOCKID_0         (0x1u<<8)
#define HSEM_RLR15_PROCID           (0xFFu<<0)
#define HSEM_RLR15_PROCID_0         (0x1u<<0)

#define HSEM_RLR15_PRIV_B_0X0       (0x0u<<13)
#define HSEM_RLR15_PRIV_B_0X1       (0x1u<<13)
#define HSEM_RLR15_SEC_B_0X0        (0x0u<<12)
#define HSEM_RLR15_SEC_B_0X1        (0x1u<<12)

// RLR16 Configuration

#define HSEM_RLR16_LOCK             (0x1u<<31)
#define HSEM_RLR16_PRIV             (0x1u<<13)
#define HSEM_RLR16_SEC              (0x1u<<12)
#define HSEM_RLR16_LOCKID           (0xFu<<8)
#define HSEM_RLR16_LOCKID_0         (0x1u<<8)
#define HSEM_RLR16_PROCID           (0xFFu<<0)
#define HSEM_RLR16_PROCID_0         (0x1u<<0)

#define HSEM_RLR16_PRIV_B_0X0       (0x0u<<13)
#define HSEM_RLR16_PRIV_B_0X1       (0x1u<<13)
#define HSEM_RLR16_SEC_B_0X0        (0x0u<<12)
#define HSEM_RLR16_SEC_B_0X1        (0x1u<<12)

