Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32V873/Includes/Registers/stm32V873_hsem.h
// RLR17 Configuration

#define HSEM_RLR17_LOCK             (0x1u<<31)
#define HSEM_RLR17_PRIV             (0x1u<<13)
#define HSEM_RLR17_SEC              (0x1u<<12)
#define HSEM_RLR17_LOCKID           (0xFu<<8)
#define HSEM_RLR17_LOCKID_0         (0x1u<<8)
#define HSEM_RLR17_PROCID           (0xFFu<<0)
#define HSEM_RLR17_PROCID_0         (0x1u<<0)

#define HSEM_RLR17_PRIV_B_0X0       (0x0u<<13)
#define HSEM_RLR17_PRIV_B_0X1       (0x1u<<13)
#define HSEM_RLR17_SEC_B_0X0        (0x0u<<12)
#define HSEM_RLR17_SEC_B_0X1        (0x1u<<12)

// RLR18 Configuration

#define HSEM_RLR18_LOCK             (0x1u<<31)
#define HSEM_RLR18_PRIV             (0x1u<<13)
#define HSEM_RLR18_SEC              (0x1u<<12)
#define HSEM_RLR18_LOCKID           (0xFu<<8)
#define HSEM_RLR18_LOCKID_0         (0x1u<<8)
#define HSEM_RLR18_PROCID           (0xFFu<<0)
#define HSEM_RLR18_PROCID_0         (0x1u<<0)

#define HSEM_RLR18_PRIV_B_0X0       (0x0u<<13)
#define HSEM_RLR18_PRIV_B_0X1       (0x1u<<13)
#define HSEM_RLR18_SEC_B_0X0        (0x0u<<12)
#define HSEM_RLR18_SEC_B_0X1        (0x1u<<12)

// RLR19 Configuration

#define HSEM_RLR19_LOCK             (0x1u<<31)
#define HSEM_RLR19_PRIV             (0x1u<<13)
#define HSEM_RLR19_SEC              (0x1u<<12)
#define HSEM_RLR19_LOCKID           (0xFu<<8)
#define HSEM_RLR19_LOCKID_0         (0x1u<<8)
#define HSEM_RLR19_PROCID           (0xFFu<<0)
#define HSEM_RLR19_PROCID_0         (0x1u<<0)

#define HSEM_RLR19_PRIV_B_0X0       (0x0u<<13)
#define HSEM_RLR19_PRIV_B_0X1       (0x1u<<13)
#define HSEM_RLR19_SEC_B_0X0        (0x0u<<12)
#define HSEM_RLR19_SEC_B_0X1        (0x1u<<12)

// RLR20 Configuration

#define HSEM_RLR20_LOCK             (0x1u<<31)
#define HSEM_RLR20_PRIV             (0x1u<<13)
#define HSEM_RLR20_SEC              (0x1u<<12)
#define HSEM_RLR20_LOCKID           (0xFu<<8)
#define HSEM_RLR20_LOCKID_0         (0x1u<<8)
#define HSEM_RLR20_PROCID           (0xFFu<<0)
#define HSEM_RLR20_PROCID_0         (0x1u<<0)

#define HSEM_RLR20_PRIV_B_0X0       (0x0u<<13)
#define HSEM_RLR20_PRIV_B_0X1       (0x1u<<13)
#define HSEM_RLR20_SEC_B_0X0        (0x0u<<12)
#define HSEM_RLR20_SEC_B_0X1        (0x1u<<12)

// RLR21 Configuration

#define HSEM_RLR21_LOCK             (0x1u<<31)
#define HSEM_RLR21_PRIV             (0x1u<<13)
#define HSEM_RLR21_SEC              (0x1u<<12)
#define HSEM_RLR21_LOCKID           (0xFu<<8)
#define HSEM_RLR21_LOCKID_0         (0x1u<<8)
#define HSEM_RLR21_PROCID           (0xFFu<<0)
#define HSEM_RLR21_PROCID_0         (0x1u<<0)

#define HSEM_RLR21_PRIV_B_0X0       (0x0u<<13)
#define HSEM_RLR21_PRIV_B_0X1       (0x1u<<13)
#define HSEM_RLR21_SEC_B_0X0        (0x0u<<12)
#define HSEM_RLR21_SEC_B_0X1        (0x1u<<12)

// RLR22 Configuration

#define HSEM_RLR22_LOCK             (0x1u<<31)
#define HSEM_RLR22_PRIV             (0x1u<<13)
#define HSEM_RLR22_SEC              (0x1u<<12)
#define HSEM_RLR22_LOCKID           (0xFu<<8)
#define HSEM_RLR22_LOCKID_0         (0x1u<<8)
#define HSEM_RLR22_PROCID           (0xFFu<<0)
#define HSEM_RLR22_PROCID_0         (0x1u<<0)

#define HSEM_RLR22_PRIV_B_0X0       (0x0u<<13)
#define HSEM_RLR22_PRIV_B_0X1       (0x1u<<13)
#define HSEM_RLR22_SEC_B_0X0        (0x0u<<12)
#define HSEM_RLR22_SEC_B_0X1        (0x1u<<12)

// RLR23 Configuration

#define HSEM_RLR23_LOCK             (0x1u<<31)
#define HSEM_RLR23_PRIV             (0x1u<<13)
#define HSEM_RLR23_SEC              (0x1u<<12)
#define HSEM_RLR23_LOCKID           (0xFu<<8)
#define HSEM_RLR23_LOCKID_0         (0x1u<<8)
#define HSEM_RLR23_PROCID           (0xFFu<<0)
#define HSEM_RLR23_PROCID_0         (0x1u<<0)

#define HSEM_RLR23_PRIV_B_0X0       (0x0u<<13)
#define HSEM_RLR23_PRIV_B_0X1       (0x1u<<13)
#define HSEM_RLR23_SEC_B_0X0        (0x0u<<12)
#define HSEM_RLR23_SEC_B_0X1        (0x1u<<12)

// RLR24 Configuration

#define HSEM_RLR24_LOCK             (0x1u<<31)
#define HSEM_RLR24_PRIV             (0x1u<<13)
#define HSEM_RLR24_SEC              (0x1u<<12)
#define HSEM_RLR24_LOCKID           (0xFu<<8)
#define HSEM_RLR24_LOCKID_0         (0x1u<<8)
#define HSEM_RLR24_PROCID           (0xFFu<<0)
#define HSEM_RLR24_PROCID_0         (0x1u<<0)

#define HSEM_RLR24_PRIV_B_0X0       (0x0u<<13)
#define HSEM_RLR24_PRIV_B_0X1       (0x1u<<13)
#define HSEM_RLR24_SEC_B_0X0        (0x0u<<12)
#define HSEM_RLR24_SEC_B_0X1        (0x1u<<12)

// RLR25 Configuration

#define HSEM_RLR25_LOCK             (0x1u<<31)
#define HSEM_RLR25_PRIV             (0x1u<<13)
#define HSEM_RLR25_SEC              (0x1u<<12)
#define HSEM_RLR25_LOCKID           (0xFu<<8)
#define HSEM_RLR25_LOCKID_0         (0x1u<<8)
#define HSEM_RLR25_PROCID           (0xFFu<<0)
#define HSEM_RLR25_PROCID_0         (0x1u<<0)

#define HSEM_RLR25_PRIV_B_0X0       (0x0u<<13)
#define HSEM_RLR25_PRIV_B_0X1       (0x1u<<13)
#define HSEM_RLR25_SEC_B_0X0        (0x0u<<12)
#define HSEM_RLR25_SEC_B_0X1        (0x1u<<12)

// RLR26 Configuration

#define HSEM_RLR26_LOCK             (0x1u<<31)
#define HSEM_RLR26_PRIV             (0x1u<<13)
#define HSEM_RLR26_SEC              (0x1u<<12)
#define HSEM_RLR26_LOCKID           (0xFu<<8)
#define HSEM_RLR26_LOCKID_0         (0x1u<<8)
#define HSEM_RLR26_PROCID           (0xFFu<<0)
#define HSEM_RLR26_PROCID_0         (0x1u<<0)

#define HSEM_RLR26_PRIV_B_0X0       (0x0u<<13)
#define HSEM_RLR26_PRIV_B_0X1       (0x1u<<13)
#define HSEM_RLR26_SEC_B_0X0        (0x0u<<12)
#define HSEM_RLR26_SEC_B_0X1        (0x1u<<12)

// RLR27 Configuration

#define HSEM_RLR27_LOCK             (0x1u<<31)
#define HSEM_RLR27_PRIV             (0x1u<<13)
#define HSEM_RLR27_SEC              (0x1u<<12)
#define HSEM_RLR27_LOCKID           (0xFu<<8)
#define HSEM_RLR27_LOCKID_0         (0x1u<<8)
#define HSEM_RLR27_PROCID           (0xFFu<<0)
#define HSEM_RLR27_PROCID_0         (0x1u<<0)

#define HSEM_RLR27_PRIV_B_0X0       (0x0u<<13)
#define HSEM_RLR27_PRIV_B_0X1       (0x1u<<13)
#define HSEM_RLR27_SEC_B_0X0        (0x0u<<12)
#define HSEM_RLR27_SEC_B_0X1        (0x1u<<12)

// RLR28 Configuration

#define HSEM_RLR28_LOCK             (0x1u<<31)
#define HSEM_RLR28_PRIV             (0x1u<<13)
#define HSEM_RLR28_SEC              (0x1u<<12)
#define HSEM_RLR28_LOCKID           (0xFu<<8)
#define HSEM_RLR28_LOCKID_0         (0x1u<<8)
#define HSEM_RLR28_PROCID           (0xFFu<<0)
#define HSEM_RLR28_PROCID_0         (0x1u<<0)

#define HSEM_RLR28_PRIV_B_0X0       (0x0u<<13)
#define HSEM_RLR28_PRIV_B_0X1       (0x1u<<13)
#define HSEM_RLR28_SEC_B_0X0        (0x0u<<12)
#define HSEM_RLR28_SEC_B_0X1        (0x1u<<12)

// RLR29 Configuration

#define HSEM_RLR29_LOCK             (0x1u<<31)
#define HSEM_RLR29_PRIV             (0x1u<<13)
#define HSEM_RLR29_SEC              (0x1u<<12)
#define HSEM_RLR29_LOCKID           (0xFu<<8)
#define HSEM_RLR29_LOCKID_0         (0x1u<<8)
#define HSEM_RLR29_PROCID           (0xFFu<<0)
#define HSEM_RLR29_PROCID_0         (0x1u<<0)

#define HSEM_RLR29_PRIV_B_0X0       (0x0u<<13)
#define HSEM_RLR29_PRIV_B_0X1       (0x1u<<13)
#define HSEM_RLR29_SEC_B_0X0        (0x0u<<12)
#define HSEM_RLR29_SEC_B_0X1        (0x1u<<12)

// RLR30 Configuration

#define HSEM_RLR30_LOCK             (0x1u<<31)
#define HSEM_RLR30_PRIV             (0x1u<<13)
#define HSEM_RLR30_SEC              (0x1u<<12)
#define HSEM_RLR30_LOCKID           (0xFu<<8)
#define HSEM_RLR30_LOCKID_0         (0x1u<<8)
#define HSEM_RLR30_PROCID           (0xFFu<<0)
#define HSEM_RLR30_PROCID_0         (0x1u<<0)

