Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32V873/Includes/Registers/stm32V873_hsem.h
#define HSEM_RLR30_PRIV_B_0X0       (0x0u<<13)
#define HSEM_RLR30_PRIV_B_0X1       (0x1u<<13)
#define HSEM_RLR30_SEC_B_0X0        (0x0u<<12)
#define HSEM_RLR30_SEC_B_0X1        (0x1u<<12)

// RLR31 Configuration

#define HSEM_RLR31_LOCK             (0x1u<<31)
#define HSEM_RLR31_PRIV             (0x1u<<13)
#define HSEM_RLR31_SEC              (0x1u<<12)
#define HSEM_RLR31_LOCKID           (0xFu<<8)
#define HSEM_RLR31_LOCKID_0         (0x1u<<8)
#define HSEM_RLR31_PROCID           (0xFFu<<0)
#define HSEM_RLR31_PROCID_0         (0x1u<<0)

#define HSEM_RLR31_PRIV_B_0X0       (0x0u<<13)
#define HSEM_RLR31_PRIV_B_0X1       (0x1u<<13)
#define HSEM_RLR31_SEC_B_0X0        (0x0u<<12)
#define HSEM_RLR31_SEC_B_0X1        (0x1u<<12)

// IER Configuration

#define HSEM_IER_ISE                (0xFFFFFFFFu<<0)
#define HSEM_IER_ISE_0              (0x1u<<0)

#define HSEM_IER_ISE_B_0X0          (0x0u<<0)
#define HSEM_IER_ISE_B_0X1          (0x1u<<0)

// ICR Configuration

#define HSEM_ICR_ISC                (0xFFFFFFFFu<<0)
#define HSEM_ICR_ISC_0              (0x1u<<0)

#define HSEM_ICR_ISC_B_0X0          (0x0u<<0)
#define HSEM_ICR_ISC_B_0X1          (0x1u<<0)

// ISR Configuration

#define HSEM_ISR_ISF                (0xFFFFFFFFu<<0)
#define HSEM_ISR_ISF_0              (0x1u<<0)

#define HSEM_ISR_ISF_B_0X0          (0x0u<<0)
#define HSEM_ISR_ISF_B_0X1          (0x1u<<0)

// MISR Configuration

#define HSEM_MISR_MISF              (0xFFFFFFFFu<<0)
#define HSEM_MISR_MISF_0            (0x1u<<0)

#define HSEM_MISR_MISF_B_0X0        (0x0u<<0)
#define HSEM_MISR_MISF_B_0X1        (0x1u<<0)

// SIER Configuration

#define HSEM_SIER_SISE              (0xFFFFFFFFu<<0)
#define HSEM_SIER_SISE_0            (0x1u<<0)

#define HSEM_SIER_SISE_B_0X0        (0x0u<<0)
#define HSEM_SIER_SISE_B_0X1        (0x1u<<0)

// SICR Configuration

#define HSEM_SICR_SISC              (0xFFFFFFFFu<<0)
#define HSEM_SICR_SISC_0            (0x1u<<0)

#define HSEM_SICR_SISC_B_0X0        (0x0u<<0)
#define HSEM_SICR_SISC_B_0X1        (0x1u<<0)

// SISR Configuration

#define HSEM_SISR_SISF              (0xFFFFFFFFu<<0)
#define HSEM_SISR_SISF_0            (0x1u<<0)

#define HSEM_SISR_SISF_B_0X0        (0x0u<<0)
#define HSEM_SISR_SISF_B_0X1        (0x1u<<0)

// MSISR Configuration

#define HSEM_MSISR_SMISF            (0xFFFFFFFFu<<0)
#define HSEM_MSISR_SMISF_0          (0x1u<<0)

#define HSEM_MSISR_SMISF_B_0X0      (0x0u<<0)
#define HSEM_MSISR_SMISF_B_0X1      (0x1u<<0)

// SECCFGR Configuration

#define HSEM_SECCFGR_SEC            (0xFFFFFFFFu<<0)
#define HSEM_SECCFGR_SEC_0          (0x1u<<0)

#define HSEM_SECCFGR_SEC_B_0X0      (0x0u<<0)
#define HSEM_SECCFGR_SEC_B_0X1      (0x1u<<0)

// PRIVCFGR Configuration

#define HSEM_PRIVCFGR_PRIV          (0xFFFFFFFFu<<0)
#define HSEM_PRIVCFGR_PRIV_0        (0x1u<<0)

#define HSEM_PRIVCFGR_PRIV_B_0X0    (0x0u<<0)
#define HSEM_PRIVCFGR_PRIV_B_0X1    (0x1u<<0)

// CR Configuration

#define HSEM_CR_KEY                 (0xFFFFu<<16)
#define HSEM_CR_KEY_0               (0x1u<<16)
#define HSEM_CR_PRIV                (0x1u<<13)
#define HSEM_CR_SEC                 (0x1u<<12)
#define HSEM_CR_LOCKID              (0xFu<<8)
#define HSEM_CR_LOCKID_0            (0x1u<<8)

// KEYR Configuration

#define HSEM_KEYR_KEY               (0xFFFFu<<16)
#define HSEM_KEYR_KEY_0             (0x1u<<16)
